sterentev/atdf-device-asm-include/inc/AT90USB82.inc
; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 29
.equ	INT_VECTORS_SIZE	= 0x3A
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	INT2		; External Interrupt Request 2
;	4	INT3		; External Interrupt Request 3
;	5	INT4		; External Interrupt Request 4
;	6	INT5		; External Interrupt Request 5
;	7	INT6		; External Interrupt Request 6
;	8	INT7		; External Interrupt Request 7
;	9	PCINT0		; Pin Change Interrupt Request 0
;	10	PCINT1		; Pin Change Interrupt Request 1
;	11	USB_GEN		; USB General Interrupt Request
;	12	USB_COM		; USB Endpoint/Pipe Interrupt Communication Request
;	13	WDT		; Watchdog Time-out Interrupt
;	14	TIMER1_CAPT	; Timer/Counter2 Capture Event
;	15	TIMER1_COMPA	; Timer/Counter2 Compare Match B
;	16	TIMER1_COMPB	; Timer/Counter2 Compare Match B
;	17	TIMER1_COMPC	; Timer/Counter2 Compare Match C
;	18	TIMER1_OVF	; Timer/Counter1 Overflow
;	19	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	20	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	21	TIMER0_OVF	; Timer/Counter0 Overflow
;	22	SPI_STC		; SPI Serial Transfer Complete
;	23	USART1_RX	; USART1, Rx Complete
;	24	USART1_UDRE	; USART1 Data register Empty
;	25	USART1_TX	; USART1, Tx Complete
;	26	ANALOG_COMP	; Analog Comparator
;	27	EE_READY	; EEPROM Ready
;	28	SPM_READY	; Store Program Memory Read


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	INT_RESET	; RESET		 - External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     
;#		rjmp	INT_INT0	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; INT3		 - External Interrupt Request 3
;#		reti			; INT4		 - External Interrupt Request 4
;#		reti			; INT5		 - External Interrupt Request 5
;#		reti			; INT6		 - External Interrupt Request 6
;#		reti			; INT7		 - External Interrupt Request 7
;#		rjmp	INT_PCINT0	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; USB_GEN	 - USB General Interrupt Request
;#		reti			; USB_COM	 - USB Endpoint/Pipe Interrupt Communication Request
;#		reti			; WDT		 - Watchdog Time-out Interrupt
;#		reti			; TIMER1_CAPT	 - Timer/Counter2 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter2 Compare Match B
;#		reti			; TIMER1_COMPB	 - Timer/Counter2 Compare Match B
;#		reti			; TIMER1_COMPC	 - Timer/Counter2 Compare Match C
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; SPI_STC	 - SPI Serial Transfer Complete
;#		reti			; USART1_RX	 - USART1, Rx Complete
;#		reti			; USART1_UDRE	 - USART1 Data register Empty
;#		reti			; USART1_TX	 - USART1, Tx Complete
;#		reti			; ANALOG_COMP	 - Analog Comparator
;#		rjmp	INT_EE_READY	; EE_READY	 - EEPROM Ready
;#		reti			; SPM_READY	 - Store Program Memory Read
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	INT_RESET:
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _AT90USB82_INC_ */

; ************************ END OF FILE *********************************

